In [1]:
#importing pandas libraries
import pandas as pd
import numpy  as np
%config IPCompleter.greedy=True

#ref https://pandas.pydata.org/pandas-docs/stable/pandas.pdf

In [2]:
#creating a series with index as Date
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102',periods=6))
print("The index are {} and the value are {} ".format(s1.index,s1.values))

The index are DatetimeIndex(['2013-01-02', '2013-01-03', '2013-01-04', '2013-01-05',
               '2013-01-06', '2013-01-07'],
              dtype='datetime64[ns]', freq='D') and the value are [1 2 3 4 5 6]

In [3]:
#converting a dictionary to a pandas Series
dict1={"India":100,"Japan":200,"Dubai":300}
s2=pd.Series(dict1)
s2

India    100
Japan    200
Dubai    300
dtype: int64

In [4]:
#converting dictionary into DataFrame
dict2={"One":pd.Series([1,2,3], index=["a","b","c"]),
          "Two":pd.Series([1,2,3,4], index=["a","b","c","d"])}
s3=pd.DataFrame(dict2)
s3

   One  Two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [5]:
#adding a column in DataFrame
s3["Three"]=pd.Series([10,20,30], index=["a","b","c"])
s3

   One  Two  Three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN

In [6]:
#importing csv files from same location
dataset1=pd.read_csv("property_data.csv", sep=",", delimiter=None, header="infer")
dataset1

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000.0,104.0,PUTNAM,Y,3.0,1.0,1000.0
1,100002000.0,197.0,LEXINGTON,N,3.0,1.5,NaN
2,100003000.0,NaN,LEXINGTON,N,NaN,1.0,850.0
3,100004000.0,201.0,BERKELEY,NaN,1.0,NaN,700.0
4,NaN,203.0,BERKELEY,Y,3.0,2.0,1600.0
5,100006000.0,207.0,BERKELEY,Y,NaN,1.0,800.0
6,100007000.0,NaN,WASHINGTON,NaN,2.0,NaN,950.0
7,100008000.0,213.0,TREMONT,Y,1.0,1.0,NaN
8,100009000.0,215.0,TREMONT,Y,NaN,2.0,1800.0

In [7]:
#displaying the shape and description of DataFrame
print("The Shape of the DataFrame is {} \n\nThe description are: \n \n{} ".format(dataset1.shape, dataset1.describe()))

The Shape of the DataFrame is (9, 7)

The description are:

                PID      ST_NUM  NUM_BEDROOMS  NUM_BATH        SQ_FT
count  8.000000e+00    7.000000      6.000000  7.000000     7.000000
mean   1.000050e+08  191.428571      2.166667  1.357143  1100.000000
std    2.927700e+03   39.080503      0.983192  0.475595   425.245027
min    1.000010e+08  104.000000      1.000000  1.000000   700.000000
25%    1.000028e+08  199.000000      1.250000  1.000000   825.000000
50%    1.000050e+08  203.000000      2.500000  1.000000   950.000000
75%    1.000072e+08  210.000000      3.000000  1.750000  1300.000000
max    1.000090e+08  215.000000      3.000000  2.000000  1800.000000

In [8]:
#converting DataFrame to json
dataset1.to_json(orient='index')#orient="columns","values","split"

'{"0":{"PID":100001000.0,"ST_NUM":104.0,"ST_NAME":"PUTNAM","OWN_OCCUPIED":"Y","NUM_BEDROOMS":3.0,"NUM_BATH":1.0,"SQ_FT":1000.0},"1":{"PID":100002000.0,"ST_NUM":197.0,"ST_NAME":"LEXINGTON","OWN_OCCUPIED":"N","NUM_BEDROOMS":3.0,"NUM_BATH":1.5,"SQ_FT":null},"2":{"PID":100003000.0,"ST_NUM":null,"ST_NAME":"LEXINGTON","OWN_OCCUPIED":"N","NUM_BEDROOMS":null,"NUM_BATH":1.0,"SQ_FT":850.0},"3":{"PID":100004000.0,"ST_NUM":201.0,"ST_NAME":"BERKELEY","OWN_OCCUPIED":null,"NUM_BEDROOMS":1.0,"NUM_BATH":null,"SQ_FT":700.0},"4":{"PID":null,"ST_NUM":203.0,"ST_NAME":"BERKELEY","OWN_OCCUPIED":"Y","NUM_BEDROOMS":3.0,"NUM_BATH":2.0,"SQ_FT":1600.0},"5":{"PID":100006000.0,"ST_NUM":207.0,"ST_NAME":"BERKELEY","OWN_OCCUPIED":"Y","NUM_BEDROOMS":null,"NUM_BATH":1.0,"SQ_FT":800.0},"6":{"PID":100007000.0,"ST_NUM":null,"ST_NAME":"WASHINGTON","OWN_OCCUPIED":null,"NUM_BEDROOMS":2.0,"NUM_BATH":null,"SQ_FT":950.0},"7":{"PID":100008000.0,"ST_NUM":213.0,"ST_NAME":"TREMONT","OWN_OCCUPIED":"Y","NUM_BEDROOMS":1.0,"NUM_BATH":1.0,"SQ_FT":null},"8":{"PID":100009000.0,"ST_NUM":215.0,"ST_NAME":"TREMONT","OWN_OCCUPIED":"Y","NUM_BEDROOMS":null,"NUM_BATH":2.0,"SQ_FT":1800.0}}'

In [10]:
#transpose
dataset1.T

,0,1,2,3,4,5,6,7,8
PID,1.00001e+08,1.00002e+08,1.00003e+08,1.00004e+08,NaN,1.00006e+08,1.00007e+08,1.00008e+08,1.00009e+08
ST_NUM,104,197,NaN,201,203,207,NaN,213,215
ST_NAME,PUTNAM,LEXINGTON,LEXINGTON,BERKELEY,BERKELEY,BERKELEY,WASHINGTON,TREMONT,TREMONT
OWN_OCCUPIED,Y,N,N,NaN,Y,Y,NaN,Y,Y
NUM_BEDROOMS,3,3,NaN,1,3,NaN,2,1,NaN
NUM_BATH,1,1.5,1,NaN,2,1,NaN,1,2
SQ_FT,1000,NaN,850,700,1600,800,950,NaN,1800

In [38]:
#sorting by column name
dataset1.sort_values(by="ST_NAME",axis=0,ascending=False)

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
6,100007000.0,NaN,WASHINGTON,NaN,2.0,NaN,950.0
7,100008000.0,213.0,TREMONT,Y,1.0,1.0,NaN
8,100009000.0,215.0,TREMONT,Y,NaN,2.0,1800.0
0,100001000.0,104.0,PUTNAM,Y,3.0,1.0,1000.0
1,100002000.0,197.0,LEXINGTON,N,3.0,1.5,NaN
2,100003000.0,NaN,LEXINGTON,N,NaN,1.0,850.0
3,100004000.0,201.0,BERKELEY,NaN,1.0,NaN,700.0
4,NaN,203.0,BERKELEY,Y,3.0,2.0,1600.0
5,100006000.0,207.0,BERKELEY,Y,NaN,1.0,800.0

In [12]:
#selecting the columns after conditions
dataset1[dataset1["NUM_BEDROOMS"]>2]

           PID  ST_NUM    ST_NAME OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH   SQ_FT
0  100001000.0   104.0     PUTNAM            Y           3.0       1.0  1000.0
1  100002000.0   197.0  LEXINGTON            N           3.0       1.5     NaN
4          NaN   203.0   BERKELEY            Y           3.0       2.0  1600.0

In [13]:
#checking the values
dataset1["NUM_BEDROOMS"]>2

0     True
1     True
2    False
3    False
4     True
5    False
6    False
7    False
8    False
Name: NUM_BEDROOMS, dtype: bool

In [19]:
#selecting those values of bedroomm which are available in bathroom
dataset1[dataset1["NUM_BEDROOMS"].isin(dataset1["NUM_BATH"])]

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
2,100003000.0,NaN,LEXINGTON,N,NaN,1.0,850.0
3,100004000.0,201.0,BERKELEY,NaN,1.0,NaN,700.0
5,100006000.0,207.0,BERKELEY,Y,NaN,1.0,800.0
6,100007000.0,NaN,WASHINGTON,NaN,2.0,NaN,950.0
7,100008000.0,213.0,TREMONT,Y,1.0,1.0,NaN
8,100009000.0,215.0,TREMONT,Y,NaN,2.0,1800.0

In [22]:
#checking the null values
pd.isna(dataset1)

     PID  ST_NUM  ST_NAME  OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH  SQ_FT
0  False   False    False         False         False     False  False
1  False   False    False         False         False     False   True
2  False    True    False         False          True     False  False
3  False   False    False          True         False      True  False
4   True   False    False         False         False     False  False
5  False   False    False         False          True     False  False
6  False    True    False          True         False      True  False
7  False   False    False         False         False     False   True
8  False   False    False         False          True     False  False

In [20]:
#droping the value with missing data
dataset1.dropna(how="any")

           PID  ST_NUM ST_NAME OWN_OCCUPIED  NUM_BEDROOMS  NUM_BATH   SQ_FT
0  100001000.0   104.0  PUTNAM            Y           3.0       1.0  1000.0

In [84]:
#filling the value with missing data with previous value
dataset1.ffill()#bfill() also can be used

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000.0,104.0,PUTNAM,Y,3.0,1.0,1000.0
1,100002000.0,197.0,LEXINGTON,N,3.0,1.5,1000.0
2,100003000.0,197.0,LEXINGTON,N,3.0,1.0,850.0
3,100004000.0,201.0,BERKELEY,N,1.0,1.0,700.0
4,100004000.0,203.0,BERKELEY,Y,3.0,2.0,1600.0
5,100006000.0,207.0,BERKELEY,Y,3.0,1.0,800.0
6,100007000.0,207.0,WASHINGTON,Y,2.0,1.0,950.0
7,100008000.0,213.0,TREMONT,Y,1.0,1.0,950.0
8,100009000.0,215.0,TREMONT,Y,1.0,2.0,1800.0

In [21]:
#filling the value with missing data with random values
dataset1.fillna(value=10)

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000.0,104.0,PUTNAM,Y,3.0,1.0,1000.0
1,100002000.0,197.0,LEXINGTON,N,3.0,1.5,10.0
2,100003000.0,10.0,LEXINGTON,N,10.0,1.0,850.0
3,100004000.0,201.0,BERKELEY,10,1.0,10.0,700.0
4,10.0,203.0,BERKELEY,Y,3.0,2.0,1600.0
5,100006000.0,207.0,BERKELEY,Y,10.0,1.0,800.0
6,100007000.0,10.0,WASHINGTON,10,2.0,10.0,950.0
7,100008000.0,213.0,TREMONT,Y,1.0,1.0,10.0
8,100009000.0,215.0,TREMONT,Y,10.0,2.0,1800.0

In [34]:
#grouping and count
dataset1.groupby("ST_NAME").sum()#any arithmetic operations

                    PID  ST_NUM  NUM_BEDROOMS  NUM_BATH   SQ_FT
ST_NAME
BERKELEY    200010000.0   611.0           4.0       3.0  3100.0
LEXINGTON   200005000.0   197.0           3.0       2.5   850.0
PUTNAM      100001000.0   104.0           3.0       1.0  1000.0
TREMONT     200017000.0   428.0           1.0       3.0  1800.0
WASHINGTON  100007000.0     0.0           2.0       0.0   950.0

In [41]:
#reading titanic dataset
dataset_Titanic=pd.read_csv("https://raw.githubusercontent.com/Subhamp7/ML_Kaggle/master/Titanic_Disaster_ML/train.csv")
dataset_Titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [43]:
#checking the datatype
dataset_Titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [48]:
#getting the type of single columns
type(dataset_Titanic["Name"])

pandas.core.series.Series

In [49]:
#using OR condition
dataset_Titanic[(dataset_Titanic["Pclass"] == 2) | (dataset_Titanic["Pclass"] == 3)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [66]:
#count of Age column with nan value
dataset_Titanic["Age"].isna().value_counts()

False    714
True     177
Name: Age, dtype: int64

In [72]:
#using str splitting the strings column
dataset_Titanic["Name"].str.split().str.get(1)#str.get(1) to get first elememt of all rows

0        Mr.
1       Mrs.
2      Miss.
3       Mrs.
4        Mr.
       ...
886     Rev.
887    Miss.
888    Miss.
889      Mr.
890      Mr.
Name: Name, Length: 891, dtype: object

In [76]:
#serching for particular field in column
dataset_Titanic["Name"].str.contains("Mr").value_counts()

True     647
False    244
Name: Name, dtype: int64

In [80]:
#replacing the values
dataset_Titanic["Sex"].replace({"male": "M","female": "F"})

0      M
1      F
2      F
3      F
4      M
      ..
886    M
887    F
888    F
889    M
890    M
Name: Sex, Length: 891, dtype: object

In [82]:
#to calculate the sum or any other arithmetic operations
dataset_Titanic["Fare"].agg(["sum","mean"])

sum     28693.949300
mean       32.204208
Name: Fare, dtype: float64

In [85]:
#to get the top 2 values
dataset_Titanic["Fare"].nlargest(2)

258    512.3292
679    512.3292
Name: Fare, dtype: float64